function obfuscateText() {
    var oldtext = document.getElementById("1").value.toLowerCase();
    var newtext = "";
    for (index = 0; index < oldtext.length; index++) {
        if (typeof Homoglyph[oldtext[index]] === "undefined") {
            newtext += oldtext[index];
        } else {
            var rand = getRandomInt(0, Homoglyph[oldtext[index]].length);
            newtext += Homoglyph[oldtext[index]][rand];
        }
    }
    document.getElementById("1").value = newtext;
}
function getRandomInt(min, max) {
    return Math.floor(Math.random() * (max - min)) + min;
}
document.getElementById("2").onclick = obfuscateText;
var Homoglyph = new Array();
Homoglyph[' '] = [    [' '],
    [' '],
    [' '],
    [' '],
    [' '],
    [' '],
    [' '],
    [' '],
    [' '],
    [' '],
    ['　']
];
Homoglyph['!'] = [
    ['!'],
    ['ǃ'],
    ['！']
];
Homoglyph['"'] = [
    ['"'],
    ['″'],
    ['＂']
];
Homoglyph['$'] = [
    ['$'],
    ['＄']
];
Homoglyph['%'] = [
    ['%'],
    ['％']
];
Homoglyph['&'] = [
    ['&'],
    ['＆']
];
Homoglyph["'"] = [
    ["'"],
    ["＇"]
];
Homoglyph['('] = [
    ['('],
    ['﹝'],
    ['（']
];
Homoglyph[')'] = [
    [')'],
    ['﹞'],
    ['）']
];
Homoglyph['*'] = [
    ['*'],
    ['⁎'],
    ['＊']
];
Homoglyph['+'] = [
    ['+'],
    ['＋']
];
Homoglyph[','] = [
    [','],
    ['‚'],
    ['，']
];
Homoglyph['-'] = [
    ['-'],
    ['‐'],
    ['－']
];
Homoglyph['.'] = [
    ['.'],
    ['｡'],
    ['．'],
    ['。'],
    ['‧'],
    ['․']
];
Homoglyph['/'] = [
    ['⁄'],
    ['∕'],
    ['╱'],
    ['／']
];
Homoglyph['0'] = [
    ['0'],
    ['O'],
    ['o'],
    ['Ο'],
    ['ο'],
    ['О'],
    ['о'],
    ['Օ'],
    ['𐒆'],
    ['Ｏ'],
    ['ｏ']
];
Homoglyph['1'] = [
    ['I'],
    ['1']
];
Homoglyph['2'] = [
    ['2'],
    ['２']
];
Homoglyph['3'] = [
    ['3'],
    ['３']
];
Homoglyph['4'] = [
    ['4'],
    ['４']
];
Homoglyph['5'] = [
    ['5'],
    ['５']
];
Homoglyph['6'] = [
    ['6'],
    ['６']
];
Homoglyph['7'] = [
    ['7'],
    ['７']
];
Homoglyph['8'] = [
    ['8'],
    ['Ց'],
    ['８']
];
Homoglyph['9'] = [
    ['9'],
    ['９']
];
Homoglyph[':'] = [
    [':'],
    ['։'],
    ['：'],
    ['꞉'],
    ['∶']
];
Homoglyph[';'] = [
    [';'],
    [';'],
    ['；']
];
Homoglyph['<'] = [
    ['<'],
    ['‹'],
    ['＜']
];
Homoglyph['='] = [
    ['='],
    ['＝']
];
Homoglyph['>'] = [
    ['>'],
    ['›'],
    ['＞']
];
Homoglyph['?'] = [
    ['?'],
    ['？']
];
Homoglyph['@'] = [
    ['@'],
    ['＠']
];
Homoglyph['['] = [
    ['['],
    ['［']
];
Homoglyph['\\'] = [
    ['\\'],
    ['＼']
];
Homoglyph[']'] = [
    [']'],
    ['］']
];
Homoglyph['^'] = [
    ['^'],
    ['＾']
];
Homoglyph['_'] = [
    ['_'],
    ['＿']
];
Homoglyph['`'] = [
    ['`'],
    ['｀']
];
Homoglyph['a'] = [
    ['A'],
    ['a'],
    ['À'],
    ['Á'],
    ['Â'],
    ['Ã'],
    ['Å'],
    ['à'],
    ['á'],
    ['â'],
    ['ã'],
    ['å'],
    ['ɑ'],
    ['Α'],
    ['α'],
    ['а'],
    ['Ꭺ'],
    ['Ａ'],
    ['ａ']
];
Homoglyph['b'] = [
    ['B'],
    ['b'],
    ['ß'],
    ['ʙ'],
    ['Β'],
    ['β'],
    ['В'],
    ['Ь'],
    ['Ᏼ'],
    ['ᛒ'],
    ['Ｂ'],
    ['ｂ']
];
Homoglyph['c'] = [
    ['C'],
    ['c'],
    ['ϲ'],
    ['Ϲ'],
    ['С'],
    ['с'],
    ['Ꮯ'],
    ['Ⅽ'],
    ['ⅽ'],
    ['𐒨'],
    ['Ｃ'],
    ['ｃ']
];
Homoglyph['d'] = [
    ['D'],
    ['d'],
    ['Ď'],
    ['ď'],
    ['Đ'],
    ['đ'],
    ['ԁ'],
    ['ժ'],
    ['Ꭰ'],
    ['Ⅾ'],
    ['ⅾ'],
    ['Ｄ'],
    ['ｄ']
];
Homoglyph['e'] = [
    ['E'],
    ['e'],
    ['È'],
    ['É'],
    ['Ê'],
    ['Ë'],
    ['é'],
    ['ê'],
    ['ë'],
    ['Ē'],
    ['ē'],
    ['Ĕ'],
    ['ĕ'],
    ['Ė'],
    ['ė'],
    ['Ę'],
    ['Ě'],
    ['ě'],
    ['Ε'],
    ['Е'],
    ['е'],
    ['Ꭼ'],
    ['Ｅ'],
    ['ｅ']
];
Homoglyph['f'] = [
    ['F'],
    ['f'],
    ['Ϝ'],
    ['Ｆ'],
    ['ｆ']
];
Homoglyph['g'] = [
    ['G'],
    ['g'],
    ['ɡ'],
    ['ɢ'],
    ['Ԍ'],
    ['Ꮐ'],
    ['Ｇ'],
    ['ｇ']
];
Homoglyph['h'] = [
    ['H'],
    ['h'],
    ['ʜ'],
    ['Η'],
    ['Н'],
    ['һ'],
    ['Ꮋ'],
    ['Ｈ'],
    ['ｈ']
];
Homoglyph['i'] = [
    ['I'],
    ['i'],
    ['Ι'],
    ['І'],
    ['і'],
    ['Ꭵ'],
    ['ᛁ'],
    ['Ⅰ'],
    ['ⅰ'],
    ['Ｉ'],
    ['ｉ']
];
Homoglyph['j'] = [
    ['J'],
    ['j'],
    ['ϳ'],
    ['Ј'],
    ['ј'],
    ['յ'],
    ['Ꭻ'],
    ['Ｊ'],
    ['ｊ']
];
Homoglyph['k'] = [
    ['K'],
    ['k'],
    ['Κ'],
    ['κ'],
    ['К'],
    ['Ꮶ'],
    ['ᛕ'],
    ['K'],
    ['Ｋ'],
    ['ｋ']
];
Homoglyph['l'] = [
    ['L'],
    ['l'],
    ['ʟ'],
    ['ι'],
    ['Ꮮ'],
    ['Ⅼ'],
    ['ⅼ'],
    ['Ｌ'],
    ['ｌ']
];
Homoglyph['m'] = [
    ['M'],
    ['m'],
    ['Μ'],
    ['Ϻ'],
    ['М'],
    ['Ꮇ'],
    ['ᛖ'],
    ['Ⅿ'],
    ['ⅿ'],
    ['ｍ']
];
Homoglyph['n'] = [
    ['N'],
    ['n'],
    ['ɴ'],
    ['Ν'],
    ['Ｎ'],
    ['ｎ']
];
Homoglyph['o'] = [
    ['0'],
    ['O'],
    ['o'],
    ['Ο'],
    ['ο'],
    ['О'],
    ['о'],
    ['Օ'],
    ['𐒆'],
    ['Ｏ'],
    ['ｏ']
];
Homoglyph['p'] = [
    ['P'],
    ['p'],
    ['Ρ'],
    ['ρ'],
    ['Р'],
    ['р'],
    ['Ꮲ'],
    ['Ｐ'],
    ['ｐ']
];
Homoglyph['q'] = [
    ['Q'],
    ['q'],
    ['Ⴍ'],
    ['Ⴓ'],
    ['Ｑ'],
    ['ｑ']
];
Homoglyph['r'] = [
    ['R'],
    ['r'],
    ['ʀ'],
    ['Ի'],
    ['Ꮢ'],
    ['ᚱ'],
    ['Ｒ'],
    ['ｒ']
];
Homoglyph['s'] = [
    ['S'],
    ['s'],
    ['Ѕ'],
    ['ѕ'],
    ['Տ'],
    ['Ⴝ'],
    ['Ꮪ'],
    ['𐒖'],
    ['Ｓ'],
    ['ｓ']
];
Homoglyph['t'] = [
    ['T'],
    ['t'],
    ['Τ'],
    ['τ'],
    ['Т'],
    ['Ꭲ'],
    ['Ｔ'],
    ['ｔ']
];
Homoglyph['u'] = [
    ['U'],
    ['u'],
    ['μ'],
    ['υ'],
    ['Ա'],
    ['Ս'],
    ['⋃'],
    ['Ｕ'],
    ['ｕ']
];
Homoglyph['v'] = [
    ['V'],
    ['v'],
    ['ν'],
    ['Ѵ'],
    ['ѵ'],
    ['Ꮩ'],
    ['Ⅴ'],
    ['ⅴ'],
    ['Ｖ'],
    ['ｖ']
];
Homoglyph['w'] = [
    ['W'],
    ['w'],
    ['ѡ'],
    ['Ꮃ'],
    ['Ｗ'],
    ['ｗ']
];
Homoglyph['x'] = [
    ['X'],
    ['x'],
    ['Χ'],
    ['χ'],
    ['Х'],
    ['х'],
    ['Ⅹ'],
    ['ⅹ'],
    ['Ｘ'],
    ['ｘ']
];
Homoglyph['y'] = [
    ['Y'],
    ['y'],
    ['ʏ'],
    ['Υ'],
    ['γ'],
    ['у'],
    ['Ү'],
    ['Ｙ'],
    ['ｙ']
];
Homoglyph['z'] = [
    ['Z'],
    ['z'],
    ['Ζ'],
    ['Ꮓ'],
    ['Ｚ'],
    ['ｚ']
];
Homoglyph['{'] = [
    ['{'],
    ['｛']
];
Homoglyph['|'] = [
    ['|'],
    ['ǀ'],
    ['｜']
];
Homoglyph['}'] = [
    ['}'],
    ['｝']
];
Homoglyph['~'] = [
    ['~'],
    ['⁓'],
    ['～']
];
Homoglyph['ß'] = [
    ['ß']
];
Homoglyph['ä'] = [
    ['Ä'],
    ['Ӓ']
];
Homoglyph['ö'] = [
    ['Ö'],
    ['Ӧ']
];